import React from 'react';
import './public.scss';

export default function Page() {
  const baseClass = 'public__contract';

  return (
    <div className={baseClass}>
      <div className={`${baseClass}--container`}>
        <div className={`${baseClass}--title`}>
          Публичный договор
        </div>
        <div className={`${baseClass}--text`}>
          Утверждено<br />
          14 августа 2024 г.<br /><br />
          ПУБЛИЧНЫЙ ДОГОВОР<br />
          возмездного оказания услуг<br /><br />
          Настоящий Публичный договор (далее по тексту – «Договор») определяет 
          порядок предоставления услуг, а также взаимные права, обязанности и порядок взаимоотношений 
          между Индивидуальным предпринимателем Чернобаевой Светланой Сергеевной, именуемым в дальнейшем «Исполнитель», 
          действующим на основании Свидетельства о государственной регистрации индивидуального предпринимателя № 291822011, и физическим лицом, 
          именуемым в дальнейшем «Заказчик», принявшим (акцептовавшим) публичное предложение о заключении настоящего Договора, 
          при совместном упоминании  именуемые Стороны.<br />
          Стороны, руководствуясь п.2 статьи 22 Гражданского кодекса Республики Беларусь заключили настоящий Договор о нижеследующем:

          <strong>1. ПРЕДМЕТ ДОГОВОРА</strong><br /><br />

          1.1.Исполнитель обязуется оказать Заказчику услуги по предоставлению консультаций по преодолению кризисных ситуаций, по социальной адаптации, самореализации (далее –услуги) по запросам Заказчика, а также по проведению тренингов, а Заказчик обязуется принять и оплатить услуги Исполнителя.<br />
          1.2. Консультации предоставляются Исполнителем индивидуально, группам и\или семье (супругам).<br />
          1.3. Основные понятия:<br />
          1.3.1. консультация – обсуждение какого-либо вопроса со специалистом с целью оказания помощи и поддержки в решении проблемы;<br />
          1.3.2. тренинг- форма интегрального обучения, целью которого является развитие навыков межличностного и профессионального взаимодействия и поведения.<br /><br />

          <strong>2. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА</strong><br /><br />

          2.1.Настоящий Договор является публичным договором, в соответствии с которым Исполнитель принимает на себя обязательство по оказанию услуг в отношении неопределенного круга лиц (Заказчиков), обратившихся за их оказанием.<br />
          2.2. Размещение текста настоящего Договора на сайте (www: chernobaeva.by) является публичным предложением (офертой) Исполнителя, адресованным не определенному кругу лиц заключить настоящий Договор(п.2. ст.407Гражданского Кодекса Республики Беларусь).<br />
          2.3.Заключение настоящего Договора производится путем присоединения Заказчика к настоящему Договору, т.е. посредством принятия (акцепта) Заказчиком условий настоящего Договора в целом, без каких-либо условий, изъятий и оговорок (ст.398Гражданского Кодекса Республики Беларусь).<br />
          2.4.Фактом принятия (акцепта) Заказчиком условий настоящего Договора является оплата Заказчиком заказанных им услуг в порядке и на условиях, определенных настоящим Договором (п.3 ст.408 Гражданского Кодекса Республики Беларусь).<br />
          2.5.Настоящий Договор при условии соблюдения порядка его акцепта считается заключенным в простой письменной форме (п.2,п.3ст.404ип.3ст.408ГражданскогоКодекса Республики Беларусь).<br /><br />

          <strong>3. СТОИМОСТЬ И ПОРЯДОК РАСЧЕТОВ</strong><br /><br />

          3.1. Стоимость услуг по настоящему Договору составляет:<br /><br />

          Индивидуальная консультация продолжительностью 60 минут - 100 бел. руб.<br />
          Семейная (парная) консультация продолжительностью 90 минут - 150 бел. руб.<br />
          Групповая консультация (тренинг) продолжительностью 120 минут - от 50 бел. руб.<br /><br />
                
          Исполнитель имеет право в одностороннем порядке изменять стоимость оказания услуг по настоящему Договору, посредством размещения на сайте публичного договора в новой редакции.<br />
          3.2. Оплата услуг Исполнителю производится Заказчиком по предварительной оплате до даты посещения Исполнителя по реквизитам, указанным в  п. 10.2. настоящего договора.<br />
          3.3. В случае неоплаты (несвоевременной оплаты, неполной оплаты) Заказчиком услуг в соответствии с п. 3.2. настоящего Договора Исполнитель имеет право отказаться от оказания услуг Заказчику.<br /><br />

          <strong>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</strong><br /><br />

          4.1. Исполнитель имеет право:<br />
          4.1.1. Утверждать новую стоимость услуг без согласования с Заказчиком.<br />
          4.1.2. Определять самостоятельно методы и способы оказания услуг.<br />
          4.1.3. Самостоятельно организовывать материально-техническое обеспечение с целью оказания качественных услуг в соответствии с установленными правилами и нормативами.<br />
          4.1.4. Приостановить или прекратить оказание услуг, либо расторгнуть настоящий Договор в одностороннем порядке, в случае неисполнения Заказчиком принятых на себя обязательств по данному Договору.<br /><br />

          4.2. Исполнитель обязуется:<br />
          4.2.1. Оказывать Заказчику услуги по настоящему Договору на условиях, указанных в настоящем Договоре.<br />
          4.2.2. Оказывать услуги Заказчику в рабочее время, предварительно согласованное с Заказчиком.<br />
          4.2.3. Обеспечивать конфиденциальность информации, предоставленной Заказчиком, за исключением случаев, когда предоставление доступа к такой информации для третьих лиц является необходимым условием оказания услуг, либо является обязательным в силу требований законодательства Республики Беларусь.<br />
          4.2.4.Оказать услуги квалифицированно, качественно и в срок в соответствии с условиями договора.<br />
          4.2.5. Уважать и соблюдать права, свободы и законные интересы Заказчика при оказании услуг.<br />
          4.2.6. Соблюдать нормы профессиональной этики.<br /><br />

          4.3. Заказчик имеет право:<br />
          4.3.1. Обращаться к Исполнителю за оказанием услуг в рабочее время, предварительно согласованное с Исполнителем.<br />
          4.4. Заказчик обязан:<br />
          4.4.1. Оплачивать услуги Исполнителя в порядке, размерах и в сроки, определённые настоящим Договором.<br />
          4.4.2. Обеспечивать сохранность и неразглашение конфиденциальной информации, полученной от Исполнителя или ставшей известной Заказчику в связи с исполнением Договора.<br /><br />

          <strong>5. ПОРЯДОК СДАЧИ-ПРИЕМКИ УСЛУГ</strong><br /><br />

          5.1. Отсутствие претензий Заказчика рассматривается как однозначное согласие Заказчика с тем, что услуги оказаны Исполнителем своевременно, в полном объеме и надлежащим образом.<br />
          5.2. Факт оказания Исполнителем услуг подтверждается актом сдачи-приемки оказанных услуг, который оформляется Исполнителем единолично в соответствии с требованиями, предусмотренными действующим законодательством Республики Беларусь.<br /><br />
          
          <strong>6. ОТВЕТСТВЕННОСТЬ СТОРОН</strong><br /><br />

          6.1. Если Заказчик своевременно не уплатил Исполнителю вознаграждение,  он уплачивает Исполнителю пеню в размере 0,1 % (процента) за каждый день просрочки от суммы несвоевременно перечисленного вознаграждения.<br />
          6.2. За неисполнение, либо ненадлежащее исполнение своих обязательств по настоящему Договору виновная Сторона несет ответственность в соответствии с действующим законодательством Республики Беларусь, с учетом особенностей, установленных настоящим Договором.<br /><br />

          <strong>7. СРОК ДЕЙСТВИЯ ДОГОВОРА И ПОРЯДОК ЕГО РАСТОРЖЕНИЯ</strong><br /><br />

          7.1. Настоящий Договор вступает в силу с момента совершения Заказчиком акцепта в соответствии с п. 2.4.настоящего Договора и действует до даты утверждения Исполнителем новой редакции настоящего Договора. Прекращение действия настоящего Договора не освобождает Заказчика от исполнения возникших во время его действия обязательств по оплате услуг.<br />
          7.2. Заказчик вправе в любое время отказаться от настоящего Договора при условии оплаты Исполнителю фактически понесенных им расходов.<br /><br />

          <strong>8. ПОРЯДОК ВНЕСЕНИЯ ИЗМЕНЕНИЙ И ДОПОЛНЕНИЙ В ДОГОВОР</strong><br /><br />

          8.1. Изменения и/или дополнения в настоящий Договор вносятся в одностороннем порядке по решению Исполнителя и вступают в силу с момента размещения на сайте Исполнителя новой редакции публичного договора.<br />
          8.2. Изменения и/или дополнения, вносимые Исполнителем в настоящий Договор в связи с изменением законодательства, вступают в силу одновременно с вступлением в силу изменений в данных актах законодательства.<br />
          8.3. В случае несогласия с внесенными изменениями и/или дополнениями, Заказчик имеет право расторгнуть настоящий Договор.<br />
          8.4. Уведомлением о расторжении настоящего Договора признается любое письменное уведомление Заказчика, составленное на бумажном носителе, о несогласии с внесенными изменениями и/или дополнениями или об отказе соблюдать его условия.<br />
          8.5. Стороны безоговорочно соглашаются с тем, что молчание (отсутствие письменных уведомлений о расторжении настоящего Договора, либо о несогласии с отдельными положениями настоящего Договора) признается согласием Заказчика с новой редакцией настоящего Договора (п.3 ст.159 Гражданского Кодекса Республики Беларусь).<br /><br />

          <strong>9. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</strong><br /><br />

          9.1. Все споры и разногласия, связанные с настоящим Договором, Стороны обязуются разрешать путем переговоров.<br />
          9.2. В случае если Сторонам не удастся разрешить все спорные вопросы в порядке, установленном п. 9.1. настоящего Договора, все споры, возникающие из настоящего Договора, в том числе связанные с его заключением, изменением, расторжением, исполнением, недействительностью подлежат разрешению в судебном порядке в соответствии с законодательством Республики Беларусь.<br /><br />

          <strong>10. РЕКВИЗИТЫ СТОРОН</strong><br /><br />

          10.1. Стороны безоговорочно соглашаются под реквизитами Заказчика считать информацию, указанную им при перечислении денежных средств на расчетный счет Исполнителя.<br /><br />
          10.2. Реквизиты Исполнителя:<br /><br />

          Индивидуальный предприниматель<br />
          Чернобаева Светлана Сергеевна<br />
          р/с BY71МТВК30130001093300079726 в ЗАО «МТБанк»,  код MTBKBY22<br />
          УНП 291822011<br />
        </div>
      </div>
    </div>
  );
}
