import { montserrat } from '../../constants';
import './public.scss';

export default function Page() {
  const baseClass = 'public__contract';

  return (
    <div className={baseClass}>
      <div className={`${baseClass}--container`}>
        <div className={`${baseClass}--title ${montserrat.className}`}>
          Публичный договор
        </div>
        <div className={`${baseClass}--text`}>
          Настоящий Публичный договор о платных услугах (далее – «Договор»)
          является Договором присоединения и определяет порядок оказания
          платных услуг, а также взаимные права, обязанности и порядок
          взаимоотношений между Индивидуальным предпринимателем Чернобаевой Светланой Сергеевной
          , именуемым в дальнейшем «Исполнитель», и
          лицом, именуемым в дальнейшем «Заказчик», принявшим
          (акцептовавшим) публичное предложение (оферту) о заключении
          настоящего Договора, совместно далее именуемые «Стороны», а
          каждый по отдельности – «Сторона»<br /><br />

          <strong>1. Термины и определения</strong><br /><br />

          1.1. Применяемые в Договоре термины и определения используются в
          следующем их значении:<br />
          1.1.1. Психологическая помощь (консультация) — комплекс мероприятий,
          направленных на содействие Заказчику (его работникам, если Заказчик
          является юридическим лицом, индивидуальным предпринимателем) в
          предупреждении, разрешении психологических проблем, преодолении
          последствий кризисных ситуаций, в том числе путем активизации собственных возможностей Заказчика (его
          работников, если Заказчик
          является юридическим лицом, индивидуальным предпринимателем) для
          самостоятельного предупреждения, разрешения возникающих
          психологических проблем, преодоления последствий кризисных
          ситуаций и создания необходимых для этого условий, на
          информирование Заказчика (его работников, если Заказчик является
          юридическим лицом, индивидуальным предпринимателем) о причинах
          психологических проблем и способах, средствах их предупреждения и
          разрешения, на развитие личности Заказчика, ее
          самосовершенствование и самореализацию.<br /><br />

          <strong>2. Предмет</strong><br /><br />

          2.1. Предметом Договора является оказание Исполнителем Заказчику
          (его работникам, если Заказчик является юридическим лицом,
          индивидуальным предпринимателем) психологической помощи и иных
          платных услуг согласно Перечню услуг, размещенном на интернет-
          ресурсе Исполнителя по адресу https://chernobaeva.by в
          соответствии с запросами Заказчика и возможностями Исполнителя.<br /><br />

          <strong>3. Порядок заключения Договора и условия оказания Услуг</strong><br /><br />

          3.1. Договор является публичным договором, в соответствии с которым
          Исполнитель принимает на себя обязательство по оказанию Услуг в
          соответствии с Договором и осуществляет их в отношении каждого лица,
          обратившегося за предоставлением Услуг. Исполнитель не вправе
          оказывать предпочтение одному лицу перед другим в отношении
          заключения Договора, кроме случаев, предусмотренных
          законодательством.<br />
          3.2. Размещение Договора на интернет-ресурсе Исполнителя по
          адресу https://chernobaeva.by/offerta/ является публичным предложением (офертой) Исполнителя заключить
          Договор, адресованным неопределенному кругу лиц (п. 2. ст. 407
          Гражданского кодекса Республики Беларусь).<br />
          3.3. Заключение Договора происходит посредством присоединения
          Заказчика к предложенному Договору, то есть посредством принятия
          (акцепта) Заказчиком условий Договора в целом, без каких-либо условий,
          изъятий и оговорок (ст. 398 Гражданского кодекса Республики Беларусь).<br />
          3.4. Фактом принятия (акцепта) Заказчиком условий настоящего
          Договора является оплата Заказчиком Услуг в порядке и на условиях,
          определенных Договором.<br />
          3.5. Договор, при условии соблюдения порядка его принятия (акцепта),
          считается заключенным в простой письменной форме (п.2, п.3 ст. 404 и
          п.3 ст.408 Гражданского кодекса Республики Беларусь).<br />
          3.6. Ознакомившись с текстом Договора и Прейскурантом Исполнителя
          на интернет-ресурсе Исполнителя по
          адресу https://chernobaeva.by/offerta/ Заказчик сообщает Исполнителю о своем желании получить платные
          Услуги в соответствии с Договором, указав следующую информацию:<br />
          3.6.1. наименование оказываемой платной Услуги в соответствии с
          Прейскурантом Исполнителя, при необходимости ее описание,
          детализация;<br />
          3.6.2. сведения, идентифицирующие Заказчика – фамилия, имя,
          отчество (при наличии), паспортные данные (при необходимости),
          контактный телефон, адрес электронной почты, для юридического лица,
          индивидуального предпринимателя — наименование, УНП, банковские
          реквизиты;<br />
          3.6.3. другая информация, имеющая отношение к Услуге (при
          необходимости).<br />

          3.7. На основании полученной от Заказчика информации Исполнитель
          вправе направить Заказчику требование об оплате выбранной платной
          Услуги (счет, квитанцию об оплате и т.п.) в электронном или бумажном
          виде.<br />
          3.8. Заказчик, заключая Договор, соглашается тем, что Исполнитель
          имеет право в любое время отказать в предоставлении Услуг в случае,
          если их предоставление противоречит требованиям действующего
          законодательства Республики Беларусь либо у Исполнителя отсутствует
          возможность для их оказания.<br />
          3.9. Заказчик, являющийся физическим лицом, дает свое согласие
          Исполнителю на сбор, хранение, обработку и передачу персональных
          данных Заказчика в целях оказания Услуг по Договору с соблюдением
          требований действующего законодательства Республики Беларусь.<br /><br />

          <strong>4. Стоимость, порядок и сроки оплаты Услуг</strong><br /><br />

          4.1. Стоимость Услуг утверждается Исполнителем, определяется исходя
          из объема, характера и продолжительности Услуг, затрат на оказание
          Услуг, и составляет сумму в белорусских рублях в размере, указанном в
          Прейскуранте Исполнителя, размещаемом на интернет-ресурсе
          Исполнителя по адресу https://chernobaeva.by Прейскурант Исполнителя является неотъемлемой частью Договора.
          Стоимость Услуг для нерезидентов Республики Беларусь может
          устанавливаться в иностранной валюте и указывается на интернет-
          ресурсе Исполнителя по адресу https://chernobaeva.by Стоимость Услуг, оказываемых в рамках Договора, не
          включенных в Прейскурант Исполнителя, согласовывается Сторонами
          дополнительно.<br />
          4.2. Оплата Услуг осуществляется Заказчиком на условиях полной
          предоплаты, если иное не предусмотрено соглашением Сторон. Заказчик
          производит оплату Услуг не позднее первого дня оказания Услуг. По
          решению Исполнителя Услуги, оказанные Исполнителем Заказчику,
          могут быть оплачены Заказчиком не позднее 10 (десятого) числа
          календарного месяца, следующего за месяцем оказания Услуг.
          Исполнитель вправе установить иной порядок оплаты Услуг.<br />
          4.3. Оплата заказанных Услуг без получения от Исполнителя
          подтверждения о возможности оказания Услуг (в частности, посредством
          направления требования об оплате заказанных Услуг) не допускается.<br />
          4.4. Заказчики, являющиеся юридическими лицами и индивидуальными
          предпринимателями, осуществляют оплату заказанных Услуг
          посредством безналичного перевода денежных средств на расчетный
          счет Исполнителя согласно данным и реквизитам, указанным в
          требовании об оплате заказанных Услуг.<br />
          4.5. Заказчики, являющиеся физическими лицами, осуществляют оплату
          заказанных Услуг согласованным с Исполнителем способом.<br />
          4.6. Заказчик производит оплату Услуг с указанием следующих
          реквизитов:
          Получатель платежа:<br /><br />

          ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ ЧЕРНОБАЕВА СВЕТЛАНА<br />
          СЕРГЕЕВНА<br />
          УНП:291822011<br />
          Текущий (расчетный) счетBY71MTBK30130001093300079726 в BYN<br />
          в ЗАО “МТБанк”<br />
          БИК MTBKBY22<br />
          Назначение – оплата услуг (психологическая консультация) согласно<br />
          публичного договора оферты<br /><br />

          <strong>5.Права и обязанности Сторон</strong><br /><br />

          5.1. Исполнитель имеет право:<br />
          5.1.1. самостоятельно определять формы, методы и способы оказания
          Услуг;<br />
          5.1.2. привлекать третьих лиц для исполнения своих обязательств по
          Договору и/или использовать услуги/работы третьих лиц,
          обеспечивающих возможность предоставления Услуг по Договору;<br />
          5.1.3. в любой момент изменять Прейскурант и условия Договора в
          одностороннем порядке без предварительного согласования с
          Заказчиком, обеспечивая при этом публикацию измененных условий
          Договора на интернет-ресурсе Исполнителя не менее чем за 1 (один)
          календарный день до их ввода в действие;<br />
          5.1.4. в случае несвоевременной оплаты Услуг приостановить оказание
          Услуг или расторгнуть Договор.<br />
          5.2. Исполнитель обязуется:<br />
          5.2.1. своевременно и качественно оказывать Заказчику Услуги в порядке
          и на условиях, определенных Договором, а также в объеме,
          определенном Заказчиком в запросе на предоставление Услуг;<br />
          5.2.2. организовать оказание Услуг в соответствии с установленными
          санитарными нормами, правилами, гигиеническими нормативами,
          правилами пожарной безопасности.<br />
          5.3. Заказчик имеет право:<br />
          5.3.1. требовать от Исполнителя надлежащего оказания Услуг;<br />
          5.3.2. получать платные Услуги в соответствии с Договором.<br />
          5.4. Заказчик обязуется:<br />
          5.4.1. соблюдать условия Договора, а также оплатить Исполнителю
          заказанные Услуги в порядке, размерах и в сроки, определенные
          Договором;<br />
          5.4.2. предоставлять полную, точную и достоверную информацию при
          оформлении запроса на предоставление Услуг;<br />
          5.4.3. информировать Исполнителя обо всех изменениях
          предоставленных персональных данных не позднее 3 (трех)
          календарных дней с момента таких изменений;<br />
          5.4.4. выполнять требования локальных правовых актов Исполнителя;<br />
          5.4.5. бережно относиться к помещению и имуществу Исполнителя;<br />
          5.4.6. при наличии претензий по оказанным Исполнителем Услугам
          письменно уведомить об этом Исполнителя в течение 3 (трех)
          календарных дней с момента, когда Заказчику стало известно или
          должно было стать известным о неисполнении или ненадлежащем
          исполнении Исполнителем принятых на себя обязательств по Договору.
          В противном случае Услуги считаются отказанными надлежащим
          образом и принятыми Заказчиком без возражений.<br />
          5.5. Заказчик не вправе распространять, а также передавать материалы,
          используемые и/или предоставленные Исполнителем Заказчику в
          процессе оказания Услуг, в том числе раздаточные материалы,
          материалы презентации, видео- и аудиозаписи Исполнителя, третьим
          лицам либо иным образом нарушать исключительные права на объекты
          интеллектуальной собственности Исполнителя.<br />
          5.6. Заключая Договор, Заказчик дает свое полное и безусловное
          согласие на получение от Исполнителя рекламной информации, а также
          иной информации, распространяемой Исполнителем (в том числе,
          посредством SMS-сообщений, сообщений на адреса электронной почты,
          иных сообщений), в целях и случаях, когда необходимость такого
          согласия предусмотрена законодательством.
          Заказчик проинформирован о своем праве требовать от Исполнителя
          незамедлительного прекращения размещения (распространения)
          рекламной информации в адрес Заказчика.
          Выразить свой отказ от получения рекламной информации,
          распространяемой Исполнителем, когда возможность такого отказа
          предусмотрена законодательством, Заказчик вправе любым способом,
          обеспечивающим получение такого отказа Исполнителем.
          Исполнитель обязан по первому требованию Заказчика
          незамедлительно прекратить размещение (распространение) рекламной
          информации в адрес Заказчика.<br />
          5.7. Заключая Договор, Заказчик — физическое лицо (индивидуальный
          предприниматель) -подтверждает отсутствие у него заболеваний и
          специфических особенностей характера, которые могут нанести вред
          Заказчику или иным лицам, воспрепятствовать надлежащему оказанию
          Услуг.
          В случае сокрытия данных фактов Исполнитель за жизнь и здоровье
          Заказчика ответственности не несет. Если сложившаяся ситуация
          препятствует надлежащему оказанию Услуг, Исполнитель оставляет за
          собой право приостановить оказание Услуг и не возвращать поученную
          за них оплату.<br />
          6. Порядок сдачи-приемки Услуг<br />
          6.1. Оказание и приемка Услуг в рамках Договора для Заказчиков<br />
          подтверждается Актом об оказании услуг, который составляется
          Исполнителем.<br />
          6.2. В соответствии с постановлением Министерства финансов
          Республики Беларусь от 12.02.2018г. № 13 «О единоличном составлении
          первичных учетных документов» Заказчик подтверждает и соглашается с
          тем, что Акт об оказании услуг в соответствии с Договором составляется
          Исполнителем единолично. Единолично составленный Акт об оказании
          услуг подписывается только Исполнителем. У Исполнителя отсутствует
          обязанность предоставлять Заказчику единолично составленный
          Исполнителем Акт об оказании услуг.<br />
          6.3. Услуги, по которым Заказчик не предъявил письменных претензий в
          течение 3 (трех) календарных дней с даты оказания Услуг, считаются
          оказанными надлежащим образом, принятыми Заказчиком без возражений, и подлежат оплате в соответствии с
          Договором.<br />
          6.4. Оказание и приемка Услуг в рамках Договора для Заказчиков,
          являющихся физическими лицами, может также подтверждаться фактом
          потребления Заказчиком оказанных ему Услуг и отсутствием письменных
          претензий Заказчика по оказанным Услугам, направленных Исполнителю
          в течение 3 (трех) календарных дней с даты оказания Услуги.<br /><br />

          <strong>7. Ответственность сторон</strong><br /><br />

          7.1. За неисполнение или ненадлежащее исполнение своих
          обязательств по Договору Стороны несут ответственность в
          соответствии с законодательством Республики Беларусь.<br />
          7.2. Заказчик несет ответственность перед Исполнителем за причинение
          вреда помещению и имуществу Исполнителя в соответствии с
          законодательством Республики Беларусь.<br />
          7.3. Стороны Договора безоговорочно соглашаются с тем, что
          максимальный размер убытков, которые могут быть взысканы с
          Исполнителя, ограничен суммой оплаченных Заказчиком Услуг,
          неисполнение, либо ненадлежащие исполнение которых повлекло
          причинение убытков.<br />
          7.4. Заказчик самостоятельно несет полную ответственность за любые, в
          том числе и несанкционированные действия третьих лиц, имевших место
          вследствие несоблюдения Заказчиком конфиденциальности своих
          данных или иной информации ограниченного доступа, а также за
          последствия таких действий.<br />
          7.5. Исполнитель не несет ответственности за несоответствие оказанных
          Услуг ожиданиям Заказчика и/или за его субъективную оценку Услуг.
          Такие несоответствие и/ или оценка не являются основаниями считать
          Услуги оказанными ненадлежащим образом.<br /><br />

          <strong>8. Дополнительные условия</strong><br /><br />

          8.1. В случае невозможности исполнения Договора, возникшей по вине
          Заказчика, денежные средства, уплаченные Исполнителю в соответствии
          с Договором, подлежат возврату на усмотрение Исполнителя.<br />
          8.2. В случае неоплаты (неполной оплаты) Услуг Исполнитель имеет
          право отказаться от оказания Услуг Заказчику.<br />
          8.3. Стороны не несут ответственность за неисполнение, ненадлежащее
          исполнение своих обязательств, если оно было вызвано форс-
          мажорными обстоятельствами.<br />
          8.4. Стороны договариваются, что безоговорочно признают юридическую
          силу текстов документов, полученных по каналам факсимильной связи и
          электронной почты наравне с документами, исполненными в простой
          письменной форме на бумажном носителе, за исключением случаев,
          когда оформление документов на бумажном носителе является
          обязательным в силу требований Договора.<br />
          8.5. Вся переписка, извещения и уведомления, полученные по
          факсимильной связи и на адреса электронной почты, указанные в
          Договоре в качестве реквизитов Cторон, считаются доставленными
          адресату в надлежащей форме.<br />
          8.6. Местом заключения Договора является место нахождения
          Исполнителя.<br />
          8.7. Изменения и/или дополнения в Договор вносятся в одностороннем
          порядке по решению Исполнителя в порядке, установленном Договором,
          и вступают в силу на следующий день после их опубликования.<br />
          8.8. Изменения и/или дополнения, вносимые Исполнителем в Договор в
          связи с изменением законодательства, вступают в силу одновременно со
          вступлением в силу изменений в данных актах законодательства.<br />
          8.9. Текст изменений и/или дополнений Договора, либо его новая
          редакция доводится Исполнителем до всеобщего сведения посредством
          размещения соответствующей информации на интернет-ресурсе
          Исполнителя по адресу https://chernobaeva.by/offerta/<br />
          8.10. Стороны безоговорочно соглашаются с
          тем, что молчание (отсутствие письменных уведомлений о расторжении
          Договора, либо о несогласии с отдельными положениями Договора, в
          том числе с изменением Прейскуранта Исполнителя) признается
          согласием и присоединением Заказчика к новой редакции Договора (п. 3
          ст. 159 Гражданского Кодекса Республики Беларусь).<br />
          8.11. Все Приложения, Прейскуранты, дополнительные соглашения,
          запросы Заказчика являются неотъемлемой частью Договора.<br /><br />

          <strong>9. Заключительные положения</strong><br /><br />

          9.1. Договор вступает в силу с момента его заключения, в порядке,
          установленном Договором, и действует до полного исполнения
          Сторонами своих обязательств.<br />
          9.2. Договор изменяется и расторгается в соответствии с условиями
          Договора/ законодательством Республики Беларусь.<br />
          9.3. Все споры и разногласия по Договору Стороны решают путем
          переговоров, а при недостижении согласия — в порядке, установленном
          законодательством Республики Беларусь.<br />
          9.4. Взаимоотношения Сторон, не урегулированные Договором,
          регламентируются действующим законодательством Республики
          Беларусь.<br /><br />

          <strong>10. Адреса и реквизиты Сторон</strong><br /><br />

          10.1. Стороны безоговорочно соглашаются реквизитами Заказчика
          считать информацию, предоставленную им в соответствии с п. 3.6.
          Договора, в том числе указанную в платежном документе на оплату
          Услуг.<br />
          10.2. Реквизиты Исполнителя:<br /><br />

          Получатель платежа:<br />
          ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ ЧЕРНОБАЕВА СВЕТЛАНА<br />
          СЕРГЕЕВНА<br />
          УНП:291822011<br />
          Текущий (расчетный) счетBY71MTBK30130001093300079726 в BYN<br />
          в ЗАО “МТБанк”<br />
          БИК MTBKBY22<br />
          Назначение – оплата услуг (психологическая консультация) согласно<br />
          публичного договора оферты
        </div>
      </div>
    </div>
  );
}
